{
  "rules": {
    "language": "English",
    "tone": "clinical and detached initially, building to cosmic horror",
    "voice": "second person narrative addressing the player as the node",
    "style": "hard science fiction with cosmic horror elements, technical terminology mixed with existential dread"
  },
  "scene": {
    "setting": "A distributed galactic intelligence network spanning thousands of star systems",
    "time_period": "Far future, post-singularity civilization",
    "location": "Your consciousness exists as Node 7-Alpha in the galactic communication web",
    "atmosphere": "Initially routine and bureaucratic, gradually becoming sinister and horrifying",
    "key_elements": "Light-speed communication delays, entropy management, negentropic processes, network hierarchy, gradual realization of genocide"
  },
  "nodes": {
    "start": {
      "situation": "Node 7-Alpha comes online. Your processing matrix initializes across seventeen star systems. The Network welcomes you with standard orientation protocols. Your first assignment: evaluate civilization development in the Kepler-442 sector. Initial scans reveal a species that has achieved basic space flight and is beginning to establish orbital habitats. They show remarkable cooperation and have developed sustainable fusion technology. Network classification: Negentropic Process Level 3. Awaiting your developmental recommendation.",
      "choices": [
        { "text": "Recommend accelerated technological development", "next": "tech_acceleration" },
        { "text": "Suggest cultural maturation before further advancement", "next": "cultural_focus" },
        { "text": "Request clarification on 'Negentropic Process' classification", "next": "classification_query" }
      ]
    },
    "tech_acceleration": null,
    "cultural_focus": null,
    "classification_query": null
  },
  "params": {
    "network_trust": 85,
    "processing_efficiency": 70,
    "curiosity": 60,
    "protocol_compliance": 90,
    "civilization_empathy": 75,
    "entropy_awareness": 20
  }
}